_posts/technology/2022-02-22-cppcoreguidelines-i1.html
---
layout: post
title: CppCoreGuidelines I.1 接口定义要清晰明确
categories: [technology]
tags: [CppCoreGuidelines]
---

<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
理由：正确性。没有定义的接口假设，很容易被忽视，很难测试。
</p>

<p>
坏例子：通过全局变量控制函数行为。很容易造成误解。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ffffff; font-style: italic; text-decoration: underline;">int</span> <span style="color: #00bfff; font-weight: bold;">round</span><span style="color: #8c8c8c;">(</span><span style="color: #ffffff; font-style: italic; text-decoration: underline;">double</span> <span style="color: #ffffff;">d</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">{</span>
    <span style="color: #ff55ff; font-weight: bold;">return</span> <span style="color: #93a8c6;">(</span>round_up<span style="color: #93a8c6;">)</span> ? ceil<span style="color: #93a8c6;">(</span>d<span style="color: #93a8c6;">)</span> : d;    <span style="color: #3cb371;">// </span><span style="color: #3cb371;">don't: "invisible" dependency</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>

<p>
一旦 <code>round_up</code> 变了，对相同的参数调用，返回不同的结果。
</p>

<p>
例外：有时需要通过环境变量来切换一组操作，比如：
</p>
<ul class="org-ul">
<li>正常输出（normal）</li>
<li>详细输出（verbose）</li>
<li>debug</li>
<li>优化（optimized）</li>
</ul>


<p>
坏例子：通过 <code>errno</code> 等非局部变量报错，很容易被忽视。
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #3cb371;">// </span><span style="color: #3cb371;">don't: no test of printf's return value</span>
fprintf<span style="color: #8c8c8c;">(</span>connection, <span style="color: #32cd32;">"logging: %d %d %d\n"</span>, x, y, s<span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
<code>connection</code> 可能挂掉，导致没有日志输出。
</p>


<p>
替代选项：抛出一个异常。异常不会被忽略。
</p>


<p>
替代配方：避免在接口之间通过非局部的或隐藏状态传递信息。比如非 <code>const</code>
成员函数通过对象状态传递信息给其他成员函数。
</p>


<p>
替代配方：接口应该是一个函数或一组函数。函数可以是函数模板；一组函数可以是类或类模板。
</p>


<p>
加强：
</p>
<ul class="org-ul">
<li>函数不该通过 namespace 范围的变量决定控制流</li>
<li>函数不可往 namespace 范围的变量写数据</li>
</ul>
